lluvia_web/app/controllers/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT "pages".* FROM "pages"

  def show
    @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @page = Page.new(page_params)

    respond_to do |format|
      if @page.save
---
INSERT INTO "pages" ("body", "created_at", "description", "link", "parent_id", "titulo", "tutorial", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @page.update(page_params)
---
UPDATE "pages" SET "titulo" = ?, "description" = ?, "updated_at" = ? WHERE "pages"."id" = 4  [["titulo", "Processor 01"], ["description", "Primer tutorial processor"], ["updated_at", Wed, 11 Dec 2013 14:15:43 UTC +00:00]]

  def destroy
    @page.destroy
---
DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 2]]

    def set_page
      @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "4"]]