lluvia_web/app/controllers/users_controller.rb

INSERT INTO "users" ("biography", "created_at", "designer", "developer", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "interests", "lastName", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save